Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.0.110/atdf/PIC32CM1216LE00048.atdf
<?xml version="1.0"?>
<!--
 Copyright (c) 2019 Microchip Technology Inc.

 SPDX-License-Identifier: Apache-2.0

 Licensed under the Apache License, Version 2.0 (the "License");
 you may not use this file except in compliance with the License.
 You may obtain a copy of the License at

 http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing, software
 distributed under the License is distributed on an "AS IS" BASIS,
 WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 See the License for the specific language governing permissions and
 limitations under the License.
-->
<avr-tools-device-file xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schema-version="4.4" xsi:noNamespaceSchemaLocation="../../schema/avr_tools_device_file.xsd">
  <file timestamp="2020-11-17T07:14:24Z"/>
  <variants xmlns:mhc="http://www.atmel.com/schemas/avr-tools-device-file/mhc">
    <variant ordercode="PIC32CM1216LE00048-I/Y8X" mhc:ordercode="PIC32CM1216LE00048-I/Y8X" package="TQFP48" pinout="TQFP48" speedmax="48000000" tempmin="-40" tempmax="85" vccmin="1.62" vccmax="3.63"/>
    <variant ordercode="PIC32CM1216LE00048-E/Y8X" mhc:ordercode="PIC32CM1216LE00048-E/Y8X" package="TQFP48" pinout="TQFP48" speedmax="48000000" tempmin="-40" tempmax="125" vccmin="1.62" vccmax="3.63"/>
    <variant ordercode="PIC32CM1216LE00048-I/U5B" mhc:ordercode="PIC32CM1216LE00048-I/U5B" package="QFN48" pinout="TQFP48" speedmax="48000000" tempmin="-40" tempmax="85" vccmin="1.62" vccmax="3.63"/>
    <variant ordercode="PIC32CM1216LE00048-E/U5B" mhc:ordercode="PIC32CM1216LE00048-E/U5B" package="QFN48" pinout="TQFP48" speedmax="48000000" tempmin="-40" tempmax="125" vccmin="1.62" vccmax="3.63"/>
  </variants>
  <devices>
    <device name="PIC32CM1216LE00048" architecture="CORTEX-M23" family="PIC32CM" series="PIC32CMLE00">
      <address-spaces>
        <address-space id="base" name="base" start="0" size="0x100000000" endianness="little">
          <memory-segment name="FLASH" start="0x00000000" size="0x20000" type="flash" pagesize="64" rw="RW" exec="true"/>
          <memory-segment name="AUX0" start="0x00804000" size="0x100" type="fuses" pagesize="64" rw="RW"/>
          <memory-segment name="AUX1" start="0x00806000" size="0x100" type="fuses" pagesize="64" rw="RW"/>
          <memory-segment name="AUX2" start="0x00808000" size="0x100" type="fuses" pagesize="64" rw="RW"/>
          <memory-segment name="AUX3" start="0x0080A000" size="0x100" type="fuses" pagesize="64" rw="RW"/>
          <memory-segment name="AUX4" start="0x0080C000" size="0x100" type="fuses" pagesize="64" rw="RW"/>
          <memory-segment name="AUX5" start="0x0080E000" size="0x100" type="fuses" pagesize="64" rw="RW"/>
          <memory-segment name="BOCOR" start="0x0080C000" size="0x100" type="fuses" pagesize="64" rw="RW"/>
          <memory-segment name="BOCOR1" start="0x0080C008" size="0x8" type="fuses" rw="R"/>
          <memory-segment name="CAL" start="0x00800000" size="0x8" type="fuses" rw="R"/>
          <memory-segment name="DATAFLASH" start="0x00400000" size="0x4000" type="flash" pagesize="64" rw="RW"/>
          <memory-segment name="LOCKROW" start="0x00802000" size="0x4" type="fuses" rw="R"/>
          <memory-segment name="OTP1" start="0x00806000" size="0x8" type="fuses" rw="R"/>
          <memory-segment name="OTP2" start="0x00806008" size="0x8" type="fuses" rw="R"/>
          <memory-segment name="OTP3" start="0x00806010" size="0x8" type="fuses" rw="R"/>
          <memory-segment name="OTP4" start="0x00806018" size="0x8" type="fuses" rw="R"/>
          <memory-segment name="ROM" start="0x00830000" size="0x10000" type="fuses" pagesize="64" rw="RW"/>
          <memory-segment name="SHADOW" start="0x00820000" size="0x8" type="fuses" rw="R"/>
          <memory-segment name="SW_CALIB" start="0x00806020" size="0x8" type="fuses" rw="R"/>
          <memory-segment name="TLATCH" start="0x00810000" size="0x10000" type="fuses" pagesize="64" rw="RW"/>
          <memory-segment name="USER_PAGE" start="0x00804000" size="0x100" type="user_page" pagesize="64" rw="RW"/>
          <memory-segment name="HSRAM" start="0x20000000" size="0x4000" type="ram" rw="RW" exec="true"/>
          <memory-segment name="APBA" start="0x40000000" size="0x8000" type="io" rw="RW"/>
          <memory-segment name="APBB" start="0x41000000" size="0x10000" type="io" rw="RW"/>
          <memory-segment name="APBC" start="0x42000000" size="0x6000" type="io" rw="RW"/>
          <memory-segment name="PPB" start="0xE0000000" size="0x100000" type="io" rw="RW"/>
        </address-space>
        <address-space id="fuses" name="fuses" start="0x00000000" size="0x20000000" endianness="little"/>
      </address-spaces>
      <parameters>
        <param name="NUM_IRQ" value="71" caption="Number of interrupt request lines"/>
        <param name="__ARMv8MBL_REV" value="0x0000" caption="Cortex-M23 Core Revision"/>
        <param name="__BKPT_NUM" value="4" caption="Number of FPB breakpoint comparators"/>
        <param name="__ETM_PRESENT" value="0" caption="ETM present or not"/>
        <param name="__FPU_PRESENT" value="0" caption="FPU present or not"/>
        <param name="__MPU_PRESENT" value="1" caption="MPU present or not"/>
        <param name="__MPU_REGIONS" value="12" caption="Number of MPU regions"/>
        <param name="__MTB_PRESENT" value="0" caption="MTB present or not"/>
        <param name="__NVIC_PRIO_BITS" value="2" caption="Number of NVIC Priority bits"/>
        <param name="__SAU_PRESENT" value="0" caption="SAU present or not"/>
        <param name="__SEC_ENABLED" value="0" caption="TrustZone-M enabled or not"/>
        <param name="__SYST_NUM" value="1" caption="Number of SysTick instances"/>
        <param name="__VTOR_PRESENT" value="1" caption="Vector Table Offset Register present or not"/>
        <param name="__Vendor_SysTickConfig" value="0" caption="Set to 1 if different SysTick Config is used"/>
        <param name="__WPT_NUM" value="2" caption="Number of DWT watchpoint comparators"/>
        <param name="__ARCH_ARM" value="1"/>
        <param name="__ARCH_ARM_CORTEX_M" value="1"/>
      </parameters>
      <peripherals>
        <module name="AC" id="U2245" version="1.0.2">
          <instance name="AC">
            <register-group name="AC" name-in-module="AC" address-space="base" offset="0x40003400"/>
            <signals>
              <signal group="AIN" index="0" function="B" pad="PA04"/>
              <signal group="AIN" index="1" function="B" pad="PA05"/>
              <signal group="AIN" index="2" function="B" pad="PA06"/>
              <signal group="AIN" index="3" function="B" pad="PA07"/>
              <signal group="AIN" index="4" function="B" pad="PB02"/>
              <signal group="AIN" index="5" function="B" pad="PB03"/>
              <signal group="CMP" index="0" function="H" pad="PA12"/>
              <signal group="CMP" index="0" function="H" pad="PA18"/>
              <signal group="CMP" index="1" function="H" pad="PA13"/>
              <signal group="CMP" index="1" function="H" pad="PA19"/>
              <signal group="CMP" index="2" function="H" pad="PA24"/>
              <signal group="CMP" index="3" function="H" pad="PA25"/>
            </signals>
            <parameters>
              <param name="COMPCTRL_MUXNEG_OPAMP" value="7" caption="OPAMP selection for MUXNEG"/>
              <param name="GCLK_ID" value="29" caption="Index of Generic Clock"/>
              <param name="NUM_CMP" value="4" caption="Number of comparators"/>
              <param name="PAIRS" value="2" caption="Number of pairs of comparators"/>
              <param name="INSTANCE_ID" value="13" caption="Instance index for AC"/>
            </parameters>
          </instance>
        </module>
